<?php
require_once(__DIR__ . '/env.php');

use \Xpmse\Api;
use \Xpmse\Excp;
use \Xpmse\Utils;

echo "\nXpmse\NPL 测试... \n\n\t";




class testNLP extends PHPUnit_Framework_TestCase {


	function testLexer() {
		$nlp = new \Xpmse\NLP([
			"appid" => "11703465",
			"apikey" => "xqh5yAF8VGUpamnR7wGzCAVm",
			"secretkey" => "ERSxQOkYQlikRHyFgTHcwmjLSxK7rgtB"
		]);

		$resp = $nlp->lexer("今天下雨，我骑车差点摔倒，好在我一把把把把住了");
		Utils::out( $resp );
	}


	function testKeyword() {
		
		$title = "小船机器人：不需要人类的无人零售店也许需要一个机器导购员";
		$content = "熬过了共享单车的狂热期， 无人零售成为了今年创投圈人人必谈的新宠儿。据了解，目前包括以阿里、苏宁为代表的互联网电商零售巨头，以娃哈哈、罗森、欧尚、居然之家等为主的传统零售业，以及 缤果盒子、小麦便利店、猩便利等新兴创业公司都加入了无人商店的布局中。

艾媒咨询的《2017 中国无人零售商店专题研究报告》显示，2017 年无人零售商店交易额预计达 389.4 亿元，未来五年无人零售商店将会迎来发展红利期，2020 年预计增长率可达 281.3%，至 2022 年市场交易额将超 1.8 万亿元。

无人零售的入行门槛比共享单车稍高一些，涉足这一领域也许需要更大的实力和勇气。矿山已在眼前，有人舍命淘金致富，有人在一旁卖牛仔裤和镐头照样发家。 小船机器人就是这么一家在矿山旁卖“牛仔裤”的公司，他们研发了专门面向无人零售店的轻量级无轨服务机器人。

这款机器人有一个听起来很解渴的名字——可乐。“可乐是一款基于深度视觉、SLAM 和大数据分析支持、帮助商家进行精准营销的高科技智能服务机器人。”小船机器人创始人廖江君介绍说，可乐可以替代服务员完成商务引导、接待、导购以及品牌宣传、营销推广等任务。

廖江君描述了可乐实际工作的场景。首先，当顾客走入门店，可乐会利用人脸识别技术获取用户信息，判断用户的体貌特征并推荐它认为适合其购买的产品，这一功能主要被应用在无人鞋店、衣店等商铺内。其次，当顾客决定自行挑选时，可乐可以与用户对话，询问对方想要的颜色、品牌、尺码等，并引领用户走向指定货架。再次，当顾客只是抱着“随便逛逛”的心态走进来时，可乐可以显示促销广告，推送打折商品，促成交易。最后，当顾客离店后，可乐还会记录该名顾客的信息及偏好，以便下一次的精准营销

“机器人与人类相比的优势在于，机器人没有情绪，不会劳累，可以二十四小时持续工作。”廖江君说道，而且机器人比人类具有更强的数据分析处理能力，不会忘记货物存放的位置或同一名顾客上个月买了什么东西。“可乐可以被应用在餐厅、商场、营业厅、酒店、展馆、银行等线下服务市场，部分或全部地替代人类劳动。”

然而目前为止，无人零售店虽然已经吸引了不少名字闪着金光的巨头参与，但其商业模式和运营模式都尚处在摸索阶段，这种业态还远不能称为成熟，而且目前门店的数量也十分有限。小船现在就把机器人造了出来，是不是有点太早了？

廖江君对这个产业的未来抱有很乐观的期望。“我认为无人零售店已经扩张得很快了，而机器人就是这些店铺的刚需产品。雇一个月薪三千的售货员，一年也得三万多，而我们的机器人可以把这部分成本控制在万元以内。”

虽然目前可乐是小船机器人唯一一款成型的硬件产品，但通过搭载不同的模块，可乐可以适用于不同的应用场景。除了以上介绍的线下门店导流导购外，还可以适用于养老健康、智慧家庭等场景。

“导流导购和养老健康是我们目前在推广的两个主要方向。”廖江君介绍说，搭载了养老健康模块的可乐将扮演一个老年人的“陪伴者”的角色，主要功能包括智能陪伴（对话）、智能推荐（健康讲座）、智能监控（紧急情况报警）及视频通话等。“目前我们已经与上海地区的养老院合作，在某些养老院内率先布置机器人开始了试点。”廖江君说。

据了解，可乐目前的售价在万元左右，可自行充电，无故障工作时间大约在五年左右。据廖江君介绍，目前可乐已经销售了千余台，所售机器皆搭载小船机器人团队自主研发的模块。

小船创始人廖江君曾任 2010 年上海世博会 4G 主干网络负责人，曾参与设计西门子第一款电交换芯片研发和第一款光交换产品研发，并顺利进行技术攻关和后期验证交付。硬件总监陈继明有 10 年外企研发管理经验，在诺基亚、西门子和阿尔卡特朗讯有共 8 年任职经历。<a> hrellad</a>

去年 8 月，小船科技完成了两千万元的 Pre-A 轮融资，由暴风科技领投，智能领域私有资本跟投。此前, 它曾获得数百万人民币的天使轮融资。";

		$nlp = new \Xpmse\NLP([
			"appid" => "11703465",
			"apikey" => "xqh5yAF8VGUpamnR7wGzCAVm",
			"secretkey" => "ERSxQOkYQlikRHyFgTHcwmjLSxK7rgtB"
		]);

		echo "\n====\nITEMS1:\n";
		$items = $nlp->keyword( $title, $content );
		Utils::out( $items );

		echo "\n====\nITEMS2:\n";
		$items2 = $nlp->keyword($title, "");
		Utils::out( $items2 );	

		echo "\n====\nITEMS3:\n";
		$items3 = $nlp->keyword("小船科技完成了两千万元的 Pre-A 轮融资，由暴风科技领投，智能领域私有资本跟投。廖江君描述了可乐实际工作的场景。首先，当顾客走入门店，可乐会利用人脸识别技术获取用户信息，判断用户的体貌特征并推荐它认为适合其购买的产品，这一功能主要被应用在无人鞋店、衣店等商铺内。其次，当顾客决定自行挑选时，可乐可以与用户对话，询问对方想要的颜色、品牌、尺码等，并引领用户走向指定货架。再次，当顾客只是抱着“随便逛逛”的心态走进来时，可乐可以显示促销广告，推送打折商品，促成交易。最后，当顾客离店后，可乐还会记录该名顾客的信息及偏好，以便下一次的精准", "");
		Utils::out( $items3 );
	}
	
}